astb_relise/src/Reports/ПланВыдачиСредствЗащиты/ПланВыдачиСредствЗащиты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Report>
  <name>ПланВыдачиСредствЗащиты</name>
</mdclass:Report>

astb_relise/src/AccumulationRegisters/ЗанятыеРабочиеМеста/ЗанятыеРабочиеМеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ЗанятыеРабочиеМеста</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/МВЗСотрудников/МВЗСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВЗСотрудников</name>
  <resources>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/МВЗПодразделений/МВЗПодразделений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВЗПодразделений</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/МВЗДолжностей/МВЗДолжностей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МВЗДолжностей</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МВЗ</name>
    <type>
      <types>CatalogRef.МВЗ</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/ОсновноеМестоРаботыСотрудника/ОсновноеМестоРаботыСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОсновноеМестоРаботыСотрудника</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ОсновноеМестоРаботы</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </resources>
  <resources>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </resources>
  <resources>
    <name>РабочееМесто</name>
    <type>
      <types>CatalogRef.РабочиеМестаАСТБ</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/InformationRegisters/СоответствияНоменклатурыВыдачи/СоответствияНоменклатурыВыдачи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СоответствияНоменклатурыВыдачи</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Использовать</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>НоменклатураНормыОрганизации</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <comment>Номенклатура выдачи</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Должность</name>
    <type>
      <types>CatalogRef.ДолжностиИПрофессии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УсловиеСоответствия</name>
    <type>
      <types>CatalogRef.ЗащитныеСвойства</types>
      <types>CatalogRef.ГОСТы</types>
      <types>String</types>
      <types>CatalogRef.ВидыСИЗ</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/AccumulationRegisters/ПотребностьВыдачиСИЗ/ПотребностьВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПотребностьВыдачиСИЗ</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ПроцентИзноса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
        <scale>6</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НормаВыдачи</name>
    <type>
      <types>CatalogRef.НормыВыдачиСИЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НоменклатураНормы</name>
    <type>
      <types>CatalogRef.НоменклатураНормОрганизации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаПотребности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

astb_relise/src/InformationRegisters/ЦеныНоменклатуры/ЦеныНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЦеныНоменклатуры</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Цена</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

astb_relise/src/Catalogs/НормыВыдачиСИЗ/НормыВыдачиСИЗ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НормыВыдачиСИЗ</name>
  <owners>Catalog.Организации</owners>
  <attributes>
    <name>ВидВыдачиСИЗ</name>
    <type>
      <types>EnumRef.ВидыВыдачиСИЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОснованиеНормы</name>
    <type>
      <types>CatalogRef.ПунктыТОН</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидРасчета</name>
    <type>
      <types>EnumRef.ВидыРасчетаНорм</types>
    </type>
  </attributes>
  <attributes>
    <name>ВесовойКоэффициент</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СоставНормы</name>
    <comment>Состав нормы (группа &quot;ИЛИ&quot;)</comment>
    <attributes>
      <name>НоменклатураНормы</name>
      <type>
        <types>CatalogRef.НоменклатураНормОрганизации</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьВыдачи</name>
      <type>
        <types>CatalogRef.ПериодичностьВыдачиСИЗ</types>
      </type>
    </attributes>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчитыватьВПотребности</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПериодичностьДляЛичнойКарточки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

astb_relise/src/Reports/ПланВыдачиСредствЗащиты/ObjectModule.bsl
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь; // отключаем стандартный вывод отчета - будем выводить программно 
	
	Настройки = КомпоновщикНастроек.ПолучитьНастройки();// Получаем настройки отчета
	
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных; // Создаем данные расшифровки 
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных; // Создаем компоновщик макета 

	ПараметрОрганизация = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Организация"));
	Если не ПараметрОрганизация = Неопределено Тогда
		Организация = ПараметрОрганизация.Значение;
		ПараметрОрганизация.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;

	ПараметрВМлнРуб = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ВМлнРуб"));
	Если не ПараметрВМлнРуб = Неопределено Тогда
		ВМлнРуб = ПараметрВМлнРуб.Значение;
		ПараметрВМлнРуб.Использование = Истина;
	Иначе
		Возврат;
	КонецЕсли;
	
	ПараметрПериодПланирования = Настройки.ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодПланирования"));
	
	Если не ПараметрПериодПланирования = Неопределено Тогда
		НачалоПериода 	= ПараметрПериодПланирования.Значение.ДатаНачала;
		КонецПериода 	= ПараметрПериодПланирования.Значение.ДатаОкончания;
	Иначе
		Возврат;
	КонецЕсли;
	
	Если НачалоМесяца(ТекущаяДата()) >= НачалоМесяца(НачалоПериода) Тогда
		Сообщить("Неверно задан период планирования!");
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЗанятыеРабочиеМестаОстатки.Сотрудник КАК Сотрудник,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение КАК Подразделение,
	|	СУММА(1) КАК ШтатнаяЧисленность,
	|	ЗанятыеРабочиеМестаОстатки.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ЗанятыеРабочиеМеста
	|ИЗ
	|	РегистрНакопления.ЗанятыеРабочиеМеста.Остатки(, Организация = &Организация) КАК ЗанятыеРабочиеМестаОстатки
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗанятыеРабочиеМестаОстатки.Сотрудник,
	|	ЗанятыеРабочиеМестаОстатки.Подразделение,
	|	ЗанятыеРабочиеМестаОстатки.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗСотрудников.Сотрудник КАК Сотрудник,
	|	МВЗСотрудников.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников
	|ИЗ
	|	РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|ГДЕ
	|	МВЗСотрудников.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|	МВЗПодразделенийСрезПоследних.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗПодразделений
	|ИЗ
	|	РегистрСведений.МВЗПодразделений.СрезПоследних(&КонецИнтервалаПоУмолчанию, Подразделение.Владелец = &Организация) КАК МВЗПодразделенийСрезПоследних
	|ГДЕ
	|	МВЗПодразделенийСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗДолжностейСрезПоследних.Должность КАК Должность,
	|	МВЗДолжностейСрезПоследних.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗДолжностей
	|ИЗ
	|	РегистрСведений.МВЗДолжностей.СрезПоследних(&КонецИнтервалаПоУмолчанию, Организация = &Организация) КАК МВЗДолжностейСрезПоследних
	|ГДЕ
	|	МВЗДолжностейСрезПоследних.Использовать
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ЗанятыеРабочиеМеста.Подразделение КАК Подразделение,
	|	СУММА(ВТ_ЗанятыеРабочиеМеста.ШтатнаяЧисленность) КАК ШтатнаяЧисленность,
	|	&НачалоИнтервалаПоУмолчанию КАК НачалоИнтервала,
	|	&КонецИнтервалаПоУмолчанию КАК КонецИнтервала,
	|	0 КАК Стоимость,
	|	ВЫБОР
	|		КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_МВЗПодразделений.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_МВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ ВТ_МВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_МВЗПодразделений.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
	|	КОНЕЦ КАК МВЗ
	|ИЗ
	|	ВТ_ЗанятыеРабочиеМеста КАК ВТ_ЗанятыеРабочиеМеста
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников КАК ВТ_МВЗСотрудников
	|		ПО ВТ_ЗанятыеРабочиеМеста.Сотрудник = ВТ_МВЗСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|		ПО ВТ_ЗанятыеРабочиеМеста.Подразделение = ВТ_МВЗПодразделений.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗДолжностей КАК ВТ_МВЗДолжностей
	|		ПО ВТ_ЗанятыеРабочиеМеста.Должность = ВТ_МВЗДолжностей.Должность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ЗанятыеРабочиеМеста.Подразделение,
	|	ВЫБОР
	|		КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_МВЗПодразделений.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_МВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ ВТ_МВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_МВЗПодразделений.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
	|	КОНЕЦ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Подразделение";
	
	Запрос.УстановитьПараметр("Организация",Организация);
	Запрос.УстановитьПараметр("НачалоИнтервалаПоУмолчанию",НачалоГода(НачалоГода(ТекущаяДата())- 1));
	Запрос.УстановитьПараметр("КонецИнтервалаПоУмолчанию",НачалоГода(НачалоГода(ТекущаяДата())- 1));
	
	ТаблицаПодразделений = Запрос.Выполнить().Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Сотрудник КАК Сотрудник,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Подразделение КАК Подразделение,
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.Должность КАК Должность
	|ПОМЕСТИТЬ ВТ_ОсновноеМестоРаботы
	|ИЗ
	|	РегистрСведений.ОсновноеМестоРаботыСотрудника.СрезПоследних(, Организация = &Организация) КАК ОсновноеМестоРаботыСотрудникаСрезПоследних
	|ГДЕ
	|	ОсновноеМестоРаботыСотрудникаСрезПоследних.ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(СоответствияНоменклатурыВыдачи.Период) КАК Период,
	|	СоответствияНоменклатурыВыдачи.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачи.Подразделение КАК Подразделение,
	|	СоответствияНоменклатурыВыдачи.Должность КАК Должность,
	|	МИНИМУМ(СоответствияНоменклатурыВыдачи.Приоритет) КАК Приоритет,
	|	СоответствияНоменклатурыВыдачи.Сотрудник КАК Сотрудник
	|ПОМЕСТИТЬ ВТ_МаппингСрезПоследних
	|ИЗ
	|	РегистрСведений.СоответствияНоменклатурыВыдачи КАК СоответствияНоменклатурыВыдачи
	|ГДЕ
	|	СоответствияНоменклатурыВыдачи.Использовать
	|	И СоответствияНоменклатурыВыдачи.Сотрудник = ЗНАЧЕНИЕ(Справочник.Сотрудники.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СоответствияНоменклатурыВыдачи.НоменклатураНормыОрганизации,
	|	СоответствияНоменклатурыВыдачи.Подразделение,
	|	СоответствияНоменклатурыВыдачи.Должность,
	|	СоответствияНоменклатурыВыдачи.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_МаппингСрезПоследних.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_МаппингСрезПоследних.Подразделение КАК Подразделение,
	|	ВТ_МаппингСрезПоследних.Должность КАК Должность,
	|	СоответствияНоменклатурыВыдачи.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Маппинг
	|ИЗ
	|	ВТ_МаппингСрезПоследних КАК ВТ_МаппингСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствияНоменклатурыВыдачи КАК СоответствияНоменклатурыВыдачи
	|		ПО ВТ_МаппингСрезПоследних.Период = СоответствияНоменклатурыВыдачи.Период
	|			И ВТ_МаппингСрезПоследних.НоменклатураНормыОрганизации = СоответствияНоменклатурыВыдачи.НоменклатураНормыОрганизации
	|			И ВТ_МаппингСрезПоследних.Подразделение = СоответствияНоменклатурыВыдачи.Подразделение
	|			И ВТ_МаппингСрезПоследних.Должность = СоответствияНоменклатурыВыдачи.Должность
	|			И ВТ_МаппингСрезПоследних.Приоритет = СоответствияНоменклатурыВыдачи.Приоритет
	|			И ВТ_МаппингСрезПоследних.Сотрудник = СоответствияНоменклатурыВыдачи.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингПоПодразделениямИДолжностям
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Подразделение КАК Подразделение,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингПоПодразделениям
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	НЕ ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Должность КАК Должность,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингПоДолжностям
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И НЕ ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_Маппинг.НоменклатураНормыОрганизации КАК НоменклатураНормыОрганизации,
	|	ВТ_Маппинг.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_МаппингБезПодразделенийИДолжностей
	|ИЗ
	|	ВТ_Маппинг КАК ВТ_Маппинг
	|ГДЕ
	|	ВТ_Маппинг.Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
	|	И ВТ_Маппинг.Должность = ЗНАЧЕНИЕ(Справочник.ДолжностиИПрофессии.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник КАК Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.Подразделение КАК Подразделение,
	|	ВТ_ОсновноеМестоРаботы.Должность КАК Должность,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ПотребностьВыдачиСИЗОстатки.КоличествоОстаток) КАК Количество,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода КАК ТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов КАК КоличествоПериодов,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности КАК ДатаПотребности
	|ПОМЕСТИТЬ ВТ_ПотребностьСЗанятымиРабочимиМестами
	|ИЗ
	|	РегистрНакопления.ПотребностьВыдачиСИЗ.Остатки(
	|			,
	|			Организация = &Организация
	|				И КОНЕЦПЕРИОДА(ДатаПотребности, МЕСЯЦ) <= КОНЕЦПЕРИОДА(&ДатаОкончания, МЕСЯЦ)) КАК ПотребностьВыдачиСИЗОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.НормыВыдачиСИЗ.СоставНормы КАК НормыВыдачиСИЗСоставНормы
	|		ПО ПотребностьВыдачиСИЗОстатки.НормаВыдачи = НормыВыдачиСИЗСоставНормы.Ссылка
	|			И ПотребностьВыдачиСИЗОстатки.НоменклатураНормы = НормыВыдачиСИЗСоставНормы.НоменклатураНормы
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ОсновноеМестоРаботы КАК ВТ_ОсновноеМестоРаботы
	|		ПО ПотребностьВыдачиСИЗОстатки.Сотрудник = ВТ_ОсновноеМестоРаботы.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ПотребностьВыдачиСИЗОстатки.Сотрудник,
	|	ВТ_ОсновноеМестоРаботы.Подразделение,
	|	ВТ_ОсновноеМестоРаботы.Должность,
	|	ПотребностьВыдачиСИЗОстатки.НоменклатураНормы,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.ТипПериода,
	|	НормыВыдачиСИЗСоставНормы.ПериодичностьВыдачи.КоличествоПериодов,
	|	ПотребностьВыдачиСИЗОстатки.ДатаПотребности
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ОсновноеМестоРаботы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	|	МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена,
	|	ЦеныНоменклатурыСрезПоследних.Поставщик КАК Поставщик
	|ПОМЕСТИТЬ ВТ_Цены
	|ИЗ
	|	РегистрСведений.ЦеныНоменклатуры.СрезПоследних(, Организация = &Организация) КАК ЦеныНоменклатурыСрезПоследних
	|
	|СГРУППИРОВАТЬ ПО
	|	ЦеныНоменклатурыСрезПоследних.Номенклатура,
	|	ЦеныНоменклатурыСрезПоследних.Поставщик
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами.Сотрудник КАК Сотрудник,
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами.Подразделение КАК Подразделение,
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами.Должность КАК Должность,
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами.НоменклатураНормы КАК НоменклатураНормы,
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами.Количество КАК Количество,
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами.ТипПериода КАК ТипПериода,
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами.КоличествоПериодов КАК КоличествоПериодов,
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами.ДатаПотребности КАК ДатаПотребности,
	|	ВЫБОР
	|		КОГДА ВТ_МаппингПоПодразделениямИДолжностям.Номенклатура ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_МаппингПоПодразделениям.Подразделение ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_МаппингПоДолжностям.Номенклатура ЕСТЬ NULL
	|									ТОГДА ВЫБОР
	|											КОГДА ВТ_МаппингБезПодразделенийИДолжностей.Номенклатура ЕСТЬ NULL
	|												ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|											ИНАЧЕ ВТ_МаппингБезПодразделенийИДолжностей.Номенклатура
	|										КОНЕЦ
	|								ИНАЧЕ ВТ_МаппингПоДолжностям.Номенклатура
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_МаппингПоПодразделениям.Подразделение
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_МаппингПоПодразделениямИДолжностям.Номенклатура
	|	КОНЕЦ КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_ПотребностьСНоменклатурой
	|ИЗ
	|	ВТ_ПотребностьСЗанятымиРабочимиМестами КАК ВТ_ПотребностьСЗанятымиРабочимиМестами
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаппингПоПодразделениямИДолжностям КАК ВТ_МаппингПоПодразделениямИДолжностям
	|		ПО ВТ_ПотребностьСЗанятымиРабочимиМестами.НоменклатураНормы = ВТ_МаппингПоПодразделениямИДолжностям.НоменклатураНормыОрганизации
	|			И ВТ_ПотребностьСЗанятымиРабочимиМестами.Подразделение = ВТ_МаппингПоПодразделениямИДолжностям.Подразделение
	|			И ВТ_ПотребностьСЗанятымиРабочимиМестами.Должность = ВТ_МаппингПоПодразделениямИДолжностям.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаппингПоПодразделениям КАК ВТ_МаппингПоПодразделениям
	|		ПО ВТ_ПотребностьСЗанятымиРабочимиМестами.НоменклатураНормы = ВТ_МаппингПоПодразделениям.НоменклатураНормыОрганизации
	|			И ВТ_ПотребностьСЗанятымиРабочимиМестами.Подразделение = ВТ_МаппингПоПодразделениям.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаппингПоДолжностям КАК ВТ_МаппингПоДолжностям
	|		ПО ВТ_ПотребностьСЗанятымиРабочимиМестами.НоменклатураНормы = ВТ_МаппингПоДолжностям.НоменклатураНормыОрганизации
	|			И ВТ_ПотребностьСЗанятымиРабочимиМестами.Должность = ВТ_МаппингПоДолжностям.Должность
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МаппингБезПодразделенийИДолжностей КАК ВТ_МаппингБезПодразделенийИДолжностей
	|		ПО ВТ_ПотребностьСЗанятымиРабочимиМестами.НоменклатураНормы = ВТ_МаппингБезПодразделенийИДолжностей.НоменклатураНормыОрганизации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_МаппингСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_Маппинг
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_МаппингПоПодразделениямИДолжностям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_МаппингПоПодразделениям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_МаппингПоДолжностям
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_МаппингБезПодразделенийИДолжностей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ВТ_ПотребностьСЗанятымиРабочимиМестами
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗСотрудников.Сотрудник КАК Сотрудник,
	|	МВЗСотрудников.МВЗ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗСотрудников
	|ИЗ
	|	РегистрСведений.МВЗСотрудников КАК МВЗСотрудников
	|ГДЕ
	|	МВЗСотрудников.Организация = &Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗПодразделенийСрезПоследних.Подразделение КАК Подразделение,
	|	МАКСИМУМ(МВЗПодразделенийСрезПоследних.МВЗ) КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗПодразделений
	|ИЗ
	|	РегистрСведений.МВЗПодразделений.СрезПоследних(&ДатаОкончания, Подразделение.Владелец = &Организация) КАК МВЗПодразделенийСрезПоследних
	|ГДЕ
	|	МВЗПодразделенийСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	МВЗПодразделенийСрезПоследних.Подразделение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МВЗДолжностейСрезПоследних.Организация КАК Организация,
	|	МВЗДолжностейСрезПоследних.Должность КАК Должность,
	|	МАКСИМУМ(МВЗДолжностейСрезПоследних.МВЗ) КАК МВЗ
	|ПОМЕСТИТЬ ВТ_МВЗДолжностей
	|ИЗ
	|	РегистрСведений.МВЗДолжностей.СрезПоследних(&ДатаОкончания, Организация = &Организация) КАК МВЗДолжностейСрезПоследних
	|ГДЕ
	|	МВЗДолжностейСрезПоследних.Использовать
	|
	|СГРУППИРОВАТЬ ПО
	|	МВЗДолжностейСрезПоследних.Организация,
	|	МВЗДолжностейСрезПоследних.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСНоменклатурой.Подразделение КАК Подразделение,
	|	ВТ_ПотребностьСНоменклатурой.ТипПериода КАК ТипПериода,
	|	ВТ_ПотребностьСНоменклатурой.КоличествоПериодов КАК КоличествоПериодов,
	|	ВТ_ПотребностьСНоменклатурой.ДатаПотребности КАК ДатаПотребности,
	|	МАКСИМУМ(ЕСТЬNULL(ВТ_Цены.Цена, 0)) КАК Цена,
	|	ВТ_ПотребностьСНоменклатурой.НоменклатураНормы КАК НоменклатураНормы,
	|	СУММА(ВТ_ПотребностьСНоменклатурой.Количество) КАК Количество,
	|	ВЫБОР
	|		КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_МВЗПодразделений.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_МВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ ВТ_МВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_МВЗПодразделений.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
	|	КОНЕЦ КАК МВЗ
	|ПОМЕСТИТЬ ВТ_ПотребностьСЦенами
	|ИЗ
	|	ВТ_ПотребностьСНоменклатурой КАК ВТ_ПотребностьСНоменклатурой
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цены КАК ВТ_Цены
	|		ПО ВТ_ПотребностьСНоменклатурой.Номенклатура = ВТ_Цены.Номенклатура
	|			И ВТ_ПотребностьСНоменклатурой.Номенклатура.Поставщик = ВТ_Цены.Поставщик
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗСотрудников КАК ВТ_МВЗСотрудников
	|		ПО ВТ_ПотребностьСНоменклатурой.Сотрудник = ВТ_МВЗСотрудников.Сотрудник
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗПодразделений КАК ВТ_МВЗПодразделений
	|		ПО ВТ_ПотребностьСНоменклатурой.Подразделение = ВТ_МВЗПодразделений.Подразделение
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МВЗДолжностей КАК ВТ_МВЗДолжностей
	|		ПО ВТ_ПотребностьСНоменклатурой.Должность = ВТ_МВЗДолжностей.Должность
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьСНоменклатурой.ТипПериода,
	|	ВТ_ПотребностьСНоменклатурой.КоличествоПериодов,
	|	ВТ_ПотребностьСНоменклатурой.ДатаПотребности,
	|	ВТ_ПотребностьСНоменклатурой.Подразделение,
	|	ВТ_ПотребностьСНоменклатурой.НоменклатураНормы,
	|	ВЫБОР
	|		КОГДА ВТ_МВЗСотрудников.МВЗ ЕСТЬ NULL
	|			ТОГДА ВЫБОР
	|					КОГДА ВТ_МВЗПодразделений.МВЗ ЕСТЬ NULL
	|						ТОГДА ВЫБОР
	|								КОГДА ВТ_МВЗДолжностей.МВЗ ЕСТЬ NULL
	|									ТОГДА ЗНАЧЕНИЕ(Справочник.МВЗ.ПустаяСсылка)
	|								ИНАЧЕ ВТ_МВЗДолжностей.МВЗ
	|							КОНЕЦ
	|					ИНАЧЕ ВТ_МВЗПодразделений.МВЗ
	|				КОНЕЦ
	|		ИНАЧЕ ВТ_МВЗСотрудников.МВЗ
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ПотребностьСЦенами.Подразделение КАК Подразделение,
	|	ВТ_ПотребностьСЦенами.ТипПериода КАК ТипПериода,
	|	ВТ_ПотребностьСЦенами.КоличествоПериодов КАК КоличествоПериодов,
	|	ВТ_ПотребностьСЦенами.ДатаПотребности КАК ДатаПотребности,
	|	СУММА(ВЫБОР
	|			КОГДА &ВМлнРуб
	|				ТОГДА ВТ_ПотребностьСЦенами.Цена * ВТ_ПотребностьСЦенами.Количество / 1000000
	|			ИНАЧЕ ВТ_ПотребностьСЦенами.Цена * ВТ_ПотребностьСЦенами.Количество
	|		КОНЕЦ) КАК Стоимость,
	|	ВТ_ПотребностьСЦенами.МВЗ КАК МВЗ
	|ИЗ
	|	ВТ_ПотребностьСЦенами КАК ВТ_ПотребностьСЦенами
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ПотребностьСЦенами.Подразделение,
	|	ВТ_ПотребностьСЦенами.ТипПериода,
	|	ВТ_ПотребностьСЦенами.КоличествоПериодов,
	|	ВТ_ПотребностьСЦенами.ДатаПотребности,
	|	ВТ_ПотребностьСЦенами.МВЗ
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВТ_ПотребностьСЦенами.Подразделение,
	|	ВТ_ПотребностьСЦенами.ДатаПотребности";
	
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("ДатаОкончания",	КонецПериода);
	Запрос.УстановитьПараметр("ВМлнРуб",		ВМлнРуб);
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДляВывода = ЗаполнитьТаблицуДляВывода(ТаблицаПодразделений,ТаблицаЗапроса,НачалоПериода,КонецПериода);
	
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Скомпонуем результат
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	
	НаборыВнешнихДанных = Новый Структура;
	НаборыВнешнихДанных.Вставить("ТаблицаДляВывода",ТаблицаДляВывода);
	
	//Инициализировать(<Макет>, <ВнешниеНаборыДанных>, <ДанныеРасшифровки>, <ВозможностьИспользованияВнешнихФункций>) 
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,НаборыВнешнихДанных , ДанныеРасшифровки, истина);
	
	ДокументРезультат.Очистить();
	
	// Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);	
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры

Функция ЗаполнитьТаблицуДляВывода(ТаблицаПодразделений,ТаблицаЗапроса,НачалоПериода,КонецПериода) 
	
	Для Каждого СтрокаТаблицыЗапроса Из ТаблицаЗапроса Цикл
		
		Если СтрокаТаблицыЗапроса.Стоимость = 0 Тогда
			Продолжить;
		КонецЕсли;	
		
		ДатаСледующейВыдачи = СтрокаТаблицыЗапроса.ДатаПотребности;
		
		Если НачалоМесяца(ДатаСледующейВыдачи) < НачалоМесяца(ТекущаяДата()) ТОгда //просроченная потребность
			
			НоваяСтрока 					= ТаблицаПодразделений.Добавить();
			НоваяСтрока.Подразделение 		= СтрокаТаблицыЗапроса.Подразделение;
			НоваяСтрока.МВЗ 				= СтрокаТаблицыЗапроса.МВЗ;
			НоваяСтрока.НачалоИнтервала 	= НачалоМесяца(НачалоМесяца(ТекущаяДата())-1);
			НоваяСтрока.КонецИнтервала 		= КонецМесяца(НоваяСтрока.НачалоИнтервала);
			НоваяСтрока.Стоимость 			= СтрокаТаблицыЗапроса.Стоимость;
			НоваяСтрока.ШтатнаяЧисленность 	= 0;
			
			ДатаСледующейВыдачи = ?(СтрокаТаблицыЗапроса.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,ДобавитьМесяц(НачалоМесяца(ТекущаяДата())-1,СтрокаТаблицыЗапроса.КоличествоПериодов * 12),ДобавитьМесяц(НачалоМесяца(ТекущаяДата())-1,СтрокаТаблицыЗапроса.КоличествоПериодов));
			
			Пока ДатаСледующейВыдачи <= КонецМесяца(КонецПериода) Цикл
				
				Если НачалоМесяца(ДатаСледующейВыдачи) >= НачалоМесяца(ТекущаяДата()) И КонецМесяца(ДатаСледующейВыдачи) <= НачалоМесяца(НачалоПериода) - 1 Тогда //потребность до периода планирования
					
					НоваяСтрока 					= ТаблицаПодразделений.Добавить();
					НоваяСтрока.Подразделение 		= СтрокаТаблицыЗапроса.Подразделение;
					НоваяСтрока.МВЗ 				= СтрокаТаблицыЗапроса.МВЗ;
					НоваяСтрока.НачалоИнтервала 	= НачалоМесяца(ТекущаяДата());
					НоваяСтрока.КонецИнтервала 		= НачалоМесяца(НачалоПериода) - 1;
					НоваяСтрока.Стоимость 			= СтрокаТаблицыЗапроса.Стоимость;
					НоваяСтрока.ШтатнаяЧисленность 	= 0;
					
					ДатаСледующейВыдачи = ?(СтрокаТаблицыЗапроса.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,ДобавитьМесяц(ДатаСледующейВыдачи,СтрокаТаблицыЗапроса.КоличествоПериодов * 12),ДобавитьМесяц(ДатаСледующейВыдачи,СтрокаТаблицыЗапроса.КоличествоПериодов));
					
				Иначе //потребность в периоде планирования
					
					НоваяСтрока 					= ТаблицаПодразделений.Добавить();
					НоваяСтрока.Подразделение 		= СтрокаТаблицыЗапроса.Подразделение;
					НоваяСтрока.МВЗ 				= СтрокаТаблицыЗапроса.МВЗ;
					НоваяСтрока.НачалоИнтервала 	= НачалоМесяца(ДатаСледующейВыдачи);
					НоваяСтрока.КонецИнтервала 		= КонецМесяца(ДатаСледующейВыдачи);
					НоваяСтрока.Стоимость 			= СтрокаТаблицыЗапроса.Стоимость;
					НоваяСтрока.ШтатнаяЧисленность 	= 0;
					
					ДатаСледующейВыдачи = ?(СтрокаТаблицыЗапроса.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,ДобавитьМесяц(НачалоМесяца(ДатаСледующейВыдачи),СтрокаТаблицыЗапроса.КоличествоПериодов * 12),ДобавитьМесяц(НачалоМесяца(ДатаСледующейВыдачи),СтрокаТаблицыЗапроса.КоличествоПериодов));
					
				КонецЕсли; 
				
			КонецЦикла;
			
		Иначе
			
			Если НачалоМесяца(ДатаСледующейВыдачи) >= НачалоМесяца(ТекущаяДата()) И КонецМесяца(ДатаСледующейВыдачи) <= НачалоМесяца(НачалоПериода) - 1 Тогда //потребность до периода планирования
				
				НоваяСтрока 					= ТаблицаПодразделений.Добавить();
				НоваяСтрока.Подразделение 		= СтрокаТаблицыЗапроса.Подразделение;
				НоваяСтрока.МВЗ 				= СтрокаТаблицыЗапроса.МВЗ;
				НоваяСтрока.НачалоИнтервала 	= НачалоМесяца(ТекущаяДата());
				НоваяСтрока.КонецИнтервала 		= НачалоМесяца(НачалоПериода) - 1;
				НоваяСтрока.Стоимость 			= СтрокаТаблицыЗапроса.Стоимость;
				НоваяСтрока.ШтатнаяЧисленность 	= 0;
				
				ДатаСледующейВыдачи = ?(СтрокаТаблицыЗапроса.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,ДобавитьМесяц(ДатаСледующейВыдачи,СтрокаТаблицыЗапроса.КоличествоПериодов * 12),ДобавитьМесяц(ДатаСледующейВыдачи,СтрокаТаблицыЗапроса.КоличествоПериодов));
				
				Пока ДатаСледующейВыдачи <= КонецМесяца(КонецПериода) Цикл
					
					Если НачалоМесяца(ДатаСледующейВыдачи) >= НачалоМесяца(ТекущаяДата()) И КонецМесяца(ДатаСледующейВыдачи) <= НачалоМесяца(НачалоПериода) - 1 Тогда //потребность до периода планирования
						
						НоваяСтрока 					= ТаблицаПодразделений.Добавить();
						НоваяСтрока.Подразделение 		= СтрокаТаблицыЗапроса.Подразделение;
						НоваяСтрока.МВЗ 				= СтрокаТаблицыЗапроса.МВЗ;
						НоваяСтрока.НачалоИнтервала 	= НачалоМесяца(ТекущаяДата());
						НоваяСтрока.КонецИнтервала 		= НачалоМесяца(НачалоПериода) - 1;
						НоваяСтрока.Стоимость 			= СтрокаТаблицыЗапроса.Стоимость;
						НоваяСтрока.ШтатнаяЧисленность 	= 0;
						
						ДатаСледующейВыдачи = ?(СтрокаТаблицыЗапроса.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,ДобавитьМесяц(ДатаСледующейВыдачи,СтрокаТаблицыЗапроса.КоличествоПериодов * 12),ДобавитьМесяц(ДатаСледующейВыдачи,СтрокаТаблицыЗапроса.КоличествоПериодов));
						
					Иначе //потребность в периоде планирования
						
						НоваяСтрока 					= ТаблицаПодразделений.Добавить();
						НоваяСтрока.Подразделение 		= СтрокаТаблицыЗапроса.Подразделение;
						НоваяСтрока.МВЗ 				= СтрокаТаблицыЗапроса.МВЗ;
						НоваяСтрока.НачалоИнтервала 	= НачалоМесяца(ДатаСледующейВыдачи);
						НоваяСтрока.КонецИнтервала 		= КонецМесяца(ДатаСледующейВыдачи);
						НоваяСтрока.Стоимость 			= СтрокаТаблицыЗапроса.Стоимость;
						НоваяСтрока.ШтатнаяЧисленность 	= 0;
						
						ДатаСледующейВыдачи = ?(СтрокаТаблицыЗапроса.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,ДобавитьМесяц(НачалоМесяца(ДатаСледующейВыдачи),СтрокаТаблицыЗапроса.КоличествоПериодов * 12),ДобавитьМесяц(НачалоМесяца(ДатаСледующейВыдачи),СтрокаТаблицыЗапроса.КоличествоПериодов));
						
					КонецЕсли; 
					
				КонецЦикла;
			
			Иначе //потребность в периоде планирования
				
				НоваяСтрока 					= ТаблицаПодразделений.Добавить();
				НоваяСтрока.Подразделение 		= СтрокаТаблицыЗапроса.Подразделение;
				НоваяСтрока.МВЗ 				= СтрокаТаблицыЗапроса.МВЗ;
				НоваяСтрока.НачалоИнтервала 	= НачалоМесяца(ДатаСледующейВыдачи);
				НоваяСтрока.КонецИнтервала 		= КонецМесяца(ДатаСледующейВыдачи);
				НоваяСтрока.Стоимость 			= СтрокаТаблицыЗапроса.Стоимость;
				НоваяСтрока.ШтатнаяЧисленность 	= 0;
				
				ДатаСледующейВыдачи = ?(СтрокаТаблицыЗапроса.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,ДобавитьМесяц(НачалоМесяца(ДатаСледующейВыдачи),СтрокаТаблицыЗапроса.КоличествоПериодов * 12),ДобавитьМесяц(НачалоМесяца(ДатаСледующейВыдачи),СтрокаТаблицыЗапроса.КоличествоПериодов));
				
				Пока ДатаСледующейВыдачи <= КонецМесяца(КонецПериода) Цикл
					
					НоваяСтрока 					= ТаблицаПодразделений.Добавить();
					НоваяСтрока.Подразделение 		= СтрокаТаблицыЗапроса.Подразделение;
					НоваяСтрока.МВЗ 				= СтрокаТаблицыЗапроса.МВЗ;
					НоваяСтрока.НачалоИнтервала 	= НачалоМесяца(ДатаСледующейВыдачи);
					НоваяСтрока.КонецИнтервала 		= КонецМесяца(ДатаСледующейВыдачи);
					НоваяСтрока.Стоимость 			= СтрокаТаблицыЗапроса.Стоимость;
					НоваяСтрока.ШтатнаяЧисленность 	= 0;
					
					ДатаСледующейВыдачи = ?(СтрокаТаблицыЗапроса.ТипПериода = Перечисления.ДоступныеПериодыОтчета.Год,ДобавитьМесяц(НачалоМесяца(ДатаСледующейВыдачи),СтрокаТаблицыЗапроса.КоличествоПериодов * 12),ДобавитьМесяц(НачалоМесяца(ДатаСледующейВыдачи),СтрокаТаблицыЗапроса.КоличествоПериодов));
					
				КонецЦикла;
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат ТаблицаПодразделений;
	
КонецФункции
